

class URLs:
    main_page_url = 'https://qa-scooter.praktikum-services.ru/'
    dzen_news_url = 'https://dzen.ru/?yredirect=true'

class MainPageTexts:
    answer_cost = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    answer_more_scooters = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    answer_rent_time = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    answer_today = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    answer_changes = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    answer_charger = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    answer_cancel = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    answer_mkad = "Да, обязательно. Всем самокатов! И Москве, и Московской области."

class OrderPageInputTexts:
    user_data_1 = ("Имя", "Фамилия", "Адрес", "+798535535555")
    rent_data_1 = ("05.05.2025", "Тестовый Комментарий 1")
    user_data_2 = ("ТестовоеИмя", "ТестоваяФамилия", "ул. Пушкина, д.38 ", "+798535535555")
    rent_data_2 = ("31.12.2024", "Тестовый Комментарий 2")